---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyDataSettings
source: html/63628109-daa0-e5b2-3dfd-153179e54816.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings

This element contains settings for gbXML Export and Heating and Cooling Load Calculations
 and project level settings for Conceptual Energy Analysis.
 for serialization

## Syntax (C#)
```csharp
public class EnergyDataSettings : Element
```